#1) ახსენით რა არის ალგორითმი და მოიყვანეთ ალგორითმის მინიმუმ 5 მაგალითი რეალური ცხოვრებიდან.

#ალგორითმი არის ინსტრუქცია რაღაც დავალების შესასრულებლად მაგალითად:კერძის მომზადება,კომპიუტერის აწყობა,კბილების გახეხვა და ა.შ


#2) ჩამოთვალეთ და დეტალურად ახსენით კომპიუტერის ძირითადი ნაწილები.


#პროცესორი-"ტვინი" ასრულებს გამოთვლებს

#ოპერატიული-მოკლევადიანი მეხსიერება,აქ ინახება ის მონაცემები რაც კომპიუტერში ამ წამს არის ჩართული

#მყარი დისკი-გრზელვადიანი მეხსიერება,სადაც ინახება ფოტოები,ვიდეოები,ფაილები და ა.შ

#დედაპლატა-ყველა კომპიუტერის ნაწილის შემაერთებელი ნაწილი

#ვიდეობარათი-გამოსახულების გამომტანი ნაწილი ეკრანზე

#კვების ბლოკი-კომპიუტერის დენის წყარო


#3) მოიძიეთ ინფორმაცია python-ის შესახებ (რა არის, რა განხრებში გამოიყენება და ა.შ)

#python არის პროგრამირების ერთ-ერთი ენა რომელიც გამოიყენება AI-ში,საიტების აწყობაში,მონაცემთა ანალიზში და ავტომატიზაციაში